9/data/attachments/d17b1c38ddab91c7.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_d366836b-e2c0-4eb9-9fd1-af3937f5afc0</nif:username>
            <nif:friendToBeAdded>Tracy_peace_Friend_67447_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>